Repository: oliver/hachoir
Catalog: hachoir-core/locale/*.po
Languages: fr

source: Hachoir library version %s
fr: Bibliothèque Hachoir version %s

source: Website: %s
fr: Site internet : %s

source: Option of console display/export
fr: Option d'affiche de la console/de l'exportation

source: Disable interactive curses mode
fr: Désactive le mode interactive curses

source: Export in XML file
fr: Exportation dans un fichier XML

source: Maximum field depth
fr: Profondeur maximale d'un champ

source: Don't display field value
fr: N'affiche pas la valeur des champs

source: Don't display field description
fr: N'affiche pas la description des champs

source: Display absolute addresses (instead of relative)
fr: Affiche l'adresse absolue (au lieu de la relative)

source: Display addresses in hexadecimal
fr: Affiche les adresses en hexadécimal

source: Disable human sizes (eg. 4 KB)
fr: Désactive les tailles humaines (ex: 4 Ko)

source: Display version and exit
fr: Affiche la version et quitte

source: Wrote output in file: %s
fr: Le résultat a été écrit dans le fichier : %s

source: Unable to open file: %s
fr: Impossible d'ouvrir le fichier : %s

source: Unable to parse file: %s
fr: Impossible de parser le fichier : %s

source: Program interrupted (CTRL+C).
fr: Programme interrompu (CTRL+C).

source: Metadata extractor version %s
fr: Extraction de méta-données version %s

source: Option of metadata extraction and display
fr: Option d'extraction des méta-données et de l'affichage

source: Only display MIME type
fr: Affiche uniquement le type MIME

source: Quantify of information to display from 1 to 9 (9 is the maximum)
fr: Quantité d'information à afficher de 1 à 9 (9 est le maximum)

source: Disable human display
fr: Désactive l'affichage humain

source: Run benchmark
fr: Lance une mesure de performance

source: Hachoir can't extract metadata, but is able to parse: %s
fr: Hachoir ne peut extraire les méta-données, mais peut parser : %s

source: (no metadata, priority may be too small)
fr: (aucun méta-donnée, la priorité doit être trop faible)

source: No suitable parser
fr: Aucun parseur adapté

source: Open error: %s
fr: Erreur d'ouverture : %s

source: Option of urwid explorer
fr: Option de l'explorateur urwid

source: Number of fields to preload at each read
fr: Nombre de champs à précharger à chaque lecture

source: Initial path to focus on
fr: Chemin initial sur lequel mettre le focus

source: Force MIME type to choose parser
fr: Forcer le type MIME pour choisir un parseur

source: Benchmark: best=%s average=%s worst=%s total=%s
fr: Benchmark : meilleur=%s moyenne=%s pire=%s total=%s

source: Run benchmark: %s calls (estimate: %s)
fr: Lance le benchmark : %s appels (estimation : %s)

source: Result %s/%s: %s (best: %s)
fr: Résultat %s/%s : %s (meilleur : %s)

source: Hachoir library
fr: Bibliothèque Hachoir

source: Verbose mode
fr: Mode bavard

source: Write log in a file
fr: Écrit les logs dans un fichier

source: Quiet mode (don't display warning)
fr: Mode silencieux (n'affiche pas les avertissements)

source: Debug mode
fr: Mode débogage

source: Display parser list
fr: Affiche la liste des parseurs

source: Key '%s' already exists
fr: La clé '%s' existe déjà

source: list assignment index out of range (%s/%s)
fr: index d'assignement d'une liste en dehors de limites (%s/%s)

source: Insert error: key '%s' ready exists
fr: Erreur d'insertion : la clé '%s' existe déjà

source: Insert error: index '%s' is invalid
fr: Erreur d'insertion : l'index %s' est invalide

source: Big endian
fr: Gros boutiste

source: Little endian
fr: Petit boutiste

source: File already exists: %s
fr: Le fichier existe déjà: %s

source: Stop Hachoir
fr: Arrête Hachoir

source: Starting Hachoir
fr: Démarrage de Hachoir

source: [Log] setFilename(%s) fails: no such file
fr: [Log] setFilename(%s) a échoué : fichier introuvable

source: List of Hachoir parsers.
fr: Liste des parseurs Hachoir.

source: Guess parser: %s
fr: Essaye le parseur : %s

source: Skip parser %s: %s
fr: Passe parser %s : %s

source: Unable to create parser %s: %s
fr: Impossible de créer le parseur %s : %s

source: (not set)
fr: (non défini)

source: invalid msdos datetime (%s)
fr: estampille de temps msdos invalide (%s)

source: %u byte
fr: %u octet

source: KB
fr: Ko

source: MB
fr: Mo

source: GB
fr: Go

source: TB
fr: To

source: [ q to quit - move with arrows, page up/down, home/end ]
fr: [ q pour quitter - touches fléchées, page haut/bas, début/fin ]

source: Hachoir is parsing your stream (be patient)...
fr: Hachoir est en train de parser votre flux (patience)...

source: Restart drawing since field has changed...
fr: Redémarre l'affichage étant donné qu'un champ a été modifié...

source: exit
fr: quitter

source: help
fr: aide

source: prev/next tab
fr: tab précédent/suivant

source: move separator vertically
fr: déplacer le séparateur vertical

source: close current tab
fr: fermer l'onglet courant

source: Parser window:
fr: Fenêtre du parseur :

source: absolute address
fr: adresse absolue

source: address in hexadecimal
fr: adresse en hexadécimal

source: human display
fr: affichage humain

source: field set size
fr: taille des ensembles de champ

source: field type
fr: type de champ

source: field value
fr: valeur du champ

source: collapse/expand
fr: déplier/replier

source: move (1 page) up/down
fr: déplacement (d'une page) haut/bas

source: move to parent field
fr: aller au champ parent

source: move to last (parent) field
fr: aller au dernier champ (du parent)

source: scroll horizontally
fr: déplacement horizontal

source: parse the selected field
fr: parser le champ actif

source: F1: help
fr: F1 : aide

source: No parser found for %s
fr: Aucun parseur trouvé pour %s

source: Error: input size is nul (source='%s')!
fr: Erreur : la taille de l'entrée est nulle (source='%s') !

source: Error: Buffers too small. Can't seek backward.
fr: Erreur : Les tampons sont trop petits. Impossible de revenir en arrière.

source: Can't read %u bytes at address %u (got %u bytes)!
fr: Impossible de lire %u octets à l'adresse %u (lu %u octets) !

source: Unable to open file %s: %s
fr: Impossible d'ouvrir le fichier %s : %s

source: File
fr: Fichier

source: File name
fr: Nom du fichier

source: File size
fr: Taille du fichier

source: File attributes
fr: Attributs du fichier

source: File type
fr: Type du fichier

source: Compressed file
fr: Fichier compressé

source: Compressed file size
fr: Taille du fichier compressé

source: Compression rate
fr: Taux de compression

source: Created on operating system: %s
fr: Crée sur le système d'exploitation : %s

source: File "%s"
fr: Fichier "%s"

source: stereo
fr: stéréo

source: Track number
fr: Numéro de la piste

source: Channel
fr: Canal

source: Sample rate
fr: Taux d'échantillonage

source: Bits/second
fr: Bits/seconde

source: Image width
fr: Largeur de l'image

source: Image height
fr: Hauteur de l'image

source: Image orientation
fr: Orientation de l'image

source: Number of colors
fr: Nombre de couleurs

source: Image format
fr: Format de l'image

source: Icon #%u (%ux%u)
fr: Icône #%u (%ux%u)

source: RGBA
fr: RVBA

source: RGB
fr: RVB

source: Color index
fr: Couleur indexées

source: Mirrored horizontal
fr: Miroir horizontal

source: Rotated 180
fr: Rotation à 180°

source: Mirrored vertical
fr: Miroir vertical

source: Camera aperture
fr: Ouverture de l'appareil photo

source: Camera focal
fr: Focale de l'appareil photo

source: Camera exposure
fr: Exposition de l'appareil photo

source: Camera brightness
fr: Luminosité de l'appareil photo

source: Camera model
fr: Modèle de l'appareil photo

source: Camera manufacturer
fr: Fabriquant de l'appareil photo

source: Grayscale
fr: Nuances de gris

source: Title
fr: Titre

source: Author
fr: Auteur

source: Duration
fr: Durée

source: Creation date
fr: Date de création

source: Last modification
fr: Dernière modification

source: Copyright
fr: Droit d'auteur

source: Producer
fr: Producteur

source: Comment
fr: Commentaire

source: Format version
fr: Version du format

source: MIME type
fr: Type MIME

source: %s has no metadata '%s'
fr: %s n'a pas de méta-donnée '%s'

source: Attribute %s (%s) is not repetable!
fr: L'attribut %s (%s) n'est pas répétable !

source: %s has no attribute '%s'
fr: %s n'a pas d'attribut '%s'

source: Attribute '%s' of %s is not set
fr: L'attribut '%s' de %s n'est pas défini

source: Common
fr: Commun

source: Has audio/video index (%s)
fr: A un index audio/vidéo (%s)

source: Video
fr: Vidéo

source: Artist
fr: Artiste

source: Frame rate
fr: Débit d'images

source: Invalid Matroska video
fr: Vidéo Matroska invalide

source: Play speed: %.1f%%
fr: Vitesse de lecture : %.1f%%

source: User volume: %.1f%%
fr: Volume utilisateur : %.1f%%

source: %s item
fr: %u élément

source: %s key
fr: %s clé
